# SetPaletteId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationNetworkChangeService..::..SetPaletteId Method
FabricationNetworkChangeService Class See Also
---
Set the fabrication palette identifier to change the elements to.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void SetPaletteId(
	int paletteId
)
```

Visual Basic
---
```text
Public Sub SetPaletteId ( _
	paletteId As Integer _
)
```

Visual C++
---
```text
public:
void SetPaletteId(
	int paletteId
)
```

# ### Parameters
paletteId
    Type: System..::..Int32
# See Also
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace